[
  {
    "slug": "GetToMarketFirst",
    "content": "## Get to market first with enhanced team collaboration\n\nIn project teams designers and developers each have different areas of expertise and different needs. Designers are focused on \"look and feel\", developers are focused on the best use of the hardware platform. Designers are more effective when they don't have to deal with development issues, developers are more efficient when they are not involved with design issues.\n\nNo matter how good the design or development tools are, there will be a gray overlap where designers and developers have to spend energy bridging the gulf between their disciplines. Kuesa 3D supplies this missing link, facilitating a smooth workflow and enabling speedy design iterations. This results in you getting to market ahead of your competitors, whilst improving your team's collaboration and effectiveness.\n\nIntegrating 3D content into your application is challenging which is why 3D engines are needed to do the hard work like rendering, 3D animations, shaders and various effects. There are several 3D engines available for this **but how does this effect your workflow**?\n\n![workflow.png](/uploads/workflow_e808f73141.png)\n"
  },
  {
    "slug": "Kuesa3DStudioWorkflow",
    "content": "## Kuesa 3D Studio's workflow\n\nWith Kuesa 3D Studio the whole design process, including scene creation, happens inside the 3D authoring tool. Designers see the final result, including materials during design time. Design changes only happen inside the 3D authoring tool, no export/import steps are required for checking the final result. It leverages all the high-grade features of that 3D tool and exports the 3D design using the glTF 2.0 format, ready for developers to easily integrate into the application.\n\n## Other workflows compared\n\nThere are two other common workflows that Kuesa 3D improves on:\n\n1. **Double-work workflows**. Single 3D assets are exported by the designer using a 3D authoring tool. The scene is put together later in the app by the developer. This forces developers to attempt to recreate the design and means designers can't work on the scene autonomously. This is very unsatisfactory, it eats into development time and there is a high risk of failure. Kuesa **3D's simplified workflow is a vast improvement over this**.\n2. **Extra step workflows**. 3D assets are exported by designers using their 3D authoring tool and then imported into a proprietary scene editor. The designer can now create the scene autonomously, however, now there is an extra export/import step and another tool required. This makes managing exported/imported 3D assets more of an effort, especially with design changes as big projects grow. **Kuesa 3D removes the need for a scene editor saving significant amounts of time**.\n\n## Syncing 3D and 2D\n\n3D authoring tools are not made for creating 2D user interfaces nor coding business logic. However, Kuesa 3D makes it easy to sync both worlds and stays consistent when moving the work up the pipeline. With Kuesa 3D Studio you can add triggers to 3D animations in order to trigger events in QML, the work is done on a single timeline (the 3D animation timeline) or by tracking 3D objects in screen space, all controlled in the 3D authoring tool."
  },
  {
    "slug": "WhatChallengesDoYouFace",
    "content": "## What challenges do you face?\n\n- Significant time lost coordinating between multiple 3D designers and developers\n- Many time-consuming iterations of a design\n- Model variations and adjustments needing speedy design and development\n- Your application needs to show the current dynamic state in realtime\n- Workflow communications between your designers and developers need improving.\n\nKuesa 3D Studio is a complete design-to-code workflow solution with the sole aim of solving these.\n\n![workflowImage.png](/uploads/workflow_Image_0b1bf7fea3.png)"
  }
]
